Revit 2027 API
CoordinationModelLinkData.ViewName Property
 The name of the Autodesk Docs view defining this Coordination Model.
 For a Coordination Model from Autodesk Docs, ViewName is the name of the view defining this Coordination Model.
 For a local Coordination Models, ViewName has an empty value.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ViewName { get; }
Public ReadOnly Property ViewName As String
	Get
public:
property String^ ViewName {
	String^ get ();
}
member ViewName : string with get
Property Value
String
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace